{
  "metadata": {
    "code": "National Building Code of Canada 2023 - Alberta Edition",
    "short_name": "NBC(AE)",
    "version": "2023",
    "section": "9.14",
    "section_title": "Drainage",
    "pages": "913-916",
    "extraction_date": "2026-01-09",
    "extraction_method": "pdfplumber"
  },
  "raw_text": "Section 9.14. Drainage\n\n9.14.1. Scope\n\n9.14.1.1. Application\n1) This Section applies to subsurface drainage and to surface drainage.\n\n9.14.1.2. Crawl Spaces\n1) Drainage for crawl spaces shall conform to Section 9.18.\n\n9.14.1.3. Floors-on-Ground\n1) Drainage requirements beneath floors-on-ground shall conform to Section 9.16.\n\n9.14.2. Foundation Drainage\n\n9.14.2.1. Foundation Wall Drainage\n1) Unless it can be shown to be unnecessary, the bottom of every exterior foundation wall shall be drained by drainage tile or pipe laid around the exterior of the foundation in conformance with Subsection 9.14.3. or by a layer of gravel or crushed rock in conformance with Subsection 9.14.4.\n2) Where mineral fibre insulation or crushed rock backfill is provided adjacent to the exterior surface of a foundation wall,\n   a) the insulation or backfill shall extend to the footing level to facilitate the drainage of groundwater to the foundation's drainage system (see Note A-9.14.2.1.(2)(a)), and\n   b) any pyritic material in the crushed rock shall be limited to a concentration that will not damage the building to a degree that would adversely affect its stability or the performance of assemblies (see Sentence 9.12.3.3.(2) and Note A-9.4.4.4.(1)).\n\n9.14.3. Drainage Tile and Pipe\n\n9.14.3.1. Material Standards\n1) Drain tile and drain pipe for foundation drainage shall conform to\n   a) ASTM C4, \"Standard Specification for Clay Drain Tile and Perforated Clay Drain Tile,\"\n   b) ASTM C412M, \"Standard Specification for Concrete Drain Tile,\"\n   c) ASTM C444M, \"Standard Specification for Perforated Concrete Pipe,\"\n   d) ASTM C700, \"Standard Specification for Vitrified Clay Pipe, Extra Strength, Standard Strength, and Perforated,\"\n   e) BNQ 3624-115, \"Polyethylene (PE) Pipe and Fittings for Soil and Foundation Drainage,\"\n   f) CSA B182.1, \"Plastic drain and sewer pipe and pipe fittings,\" or\n   g) CAN/CSA-G401, \"Corrugated steel pipe products.\"\n\n9.14.3.2. Minimum Size\n1) Drain tile or pipe used for foundation drainage shall be not less than 100 mm in diam.\n\n9.14.3.3. Installation\n1) Drain tile or pipe shall be laid on undisturbed or well-compacted soil so that the top of the tile or pipe is below the bottom of the floor slab or the ground cover of the crawl space.\n2) Drain tile or pipe with butt joints shall be laid with 6 mm to 10 mm open joints.\n3) The top half of joints referred to in Sentence (2) shall be covered with sheathing paper, 0.10 mm polyethylene or No. 15 asphalt or tar-saturated felt.\n4) The top and sides of drain pipe or tile shall be covered with not less than 150 mm of crushed stone or other coarse clean granular material containing not more than 10% of material that will pass a 4 mm sieve.\n\n9.14.4. Granular Drainage Layer\n\n9.14.4.1. Type of Granular Material\n1) Granular material used to drain the bottom of a foundation shall consist of a continuous layer of crushed stone or other coarse clean granular material containing\n   a) not more than 10% of material that will pass a 4 mm sieve, and\n   b) no pyritic material in a concentration that will damage the building to a degree that would adversely affect its stability or the performance of assemblies (see Note A-9.4.4.4.(1)).\n\n9.14.4.2. Installation\n1) Granular material described in Article 9.14.4.1. shall be laid on undisturbed or compacted soil to a minimum depth of not less than 125 mm beneath the footing of the building and extend not less than 300 mm beyond the outside edge of the footings.\n\n9.14.4.3. Grading\n1) The bottom of an excavation drained by a granular layer shall be graded so that the entire area described in Article 9.14.4.2. is drained to a sump conforming to Article 9.14.5.2.\n\n9.14.4.4. Wet Site Conditions\n1) Where because of wet site conditions soil becomes mixed with the granular drainage material, sufficient additional granular material shall be provided so that the top 125 mm are kept free of soil.\n\n9.14.5. Drainage Disposal\n\n9.14.5.1. Drainage Disposal\n1) Foundation drains shall drain to a sewer, drainage ditch or dry well.\n\n9.14.5.2. Sump Pits\n1) Where a sump pit is provided it shall be\n   a) not less than 750 mm deep,\n   b) not less than 0.25 m2 in area, and\n   c) provided with a cover.\n2) Covers for sump pits shall be designed\n   a) to resist removal by children, and\n   b) to be airtight in accordance with Sentence 9.25.3.3.(7).\n3) Where gravity drainage is not practical, an automatic sump pump shall be provided to discharge the water from the sump pit described in Sentence (1) into a sewer, drainage ditch or dry well.\n\n9.14.5.3. Dry Wells\n1) Dry wells may be used only when located in areas where the natural groundwater level is below the bottom of the dry well.\n2) Dry wells shall be not less than 5 m from the building foundation and located so that drainage is away from the building.\n\n9.14.6. Surface Drainage\n\n9.14.6.1. Surface Drainage\n1) The building shall be located or the building site graded so that water will not accumulate at or near the building.\n\n9.14.6.2. Drainage away from Wells or Septic Disposal Beds\n1) Surface drainage shall be directed away from the location of a water supply well or septic tank disposal bed.\n\n9.14.6.3. Window Wells\n1) Every window well shall be drained to the footing level or other suitable location.\n\n9.14.6.4. Catch Basin\n1) Where runoff water from a driveway is likely to accumulate or enter a garage, a catch basin shall be installed to provide adequate drainage.\n\n9.14.6.5. Downspouts\n1) Downspouts shall conform to Article 9.26.18.2.",
  "pages_extracted": [913, 914, 915, 916]
}
